[{"title": "What expectations do I have for this school year in YFF and English", "author": "Thomas, August 30th 2019", "content": "I am generally pretty excited for this school year as a whole, since I'll be doing stuff I have an interest in from before, plus all the students and even the teachers are much more laid back and easier to work with than what it would be if it were general studies. </br></br>This \"collaboration\" with YFF and English seems a little less serious than the standard boring English class, and I think it will make it a fair bit easier. I'm hoping that I will be able to learn a lot and I am looking forward to this."}, {"title": "How important was Steve Jobs' work?", "author": "Thomas, September 6th 2019", "content": "The importance of Steve Jobs' work for the technological advancement of computers and the history of computing itself is up for debate. Steve Jobs' personality and general approach to the entire deal was by many seen as hypocritical. He was known for being quite short tempered, manipulative and more focused on his work than other people. For the longest time he refused to come to terms with the fact that he was a father, and he wanted little to nothing to do with Lisa and her mother. He ended up being arrogant, believing everything he did was right. At some points he was borderline abusive, forcing his employees to work for prolonged periods of time or even degrading or neglecting the value of their work completely.</br></br>Regardless of how you look at Steve Jobs as a person, his work has nontheless been crucial in the development of the computing industry. He led development for the LISA, the Macintosh and the iMac, some of which didn't perform too well in the bigger picture, but were a step in the right direction anyway.</br></br>After watching Pirates of Silicon Valley and the first half of the Steve Jobs movie, I was getting concerned of the type of person Steve Jobs was, and his neglect towards his supposed family and his friends. However, at the end of the Steve Jobs movie you begin to see that he takes the time to reflect, and might have started to realize the mistakes of the life choices he made. He has trouble getting even with Lisa, his daughter, still trying to make others believe what he did was the right choice. As they try talking and Lisa obviously wants to just get away, you begin noticing that Steve opens up more and more, admitting to his mistakes. He's softer, more assuring, and manages to make Lisa stay and watch his release of the iMac from behind the scenes. The last scene of the movie shows Steve standing on the scene from the perspective of the backstage, while the audience is furiously clapping and applauding. Steve turns towards Lisa, and begins walking off the stage, and you can see in his expression before the screen fades to black, that he has had a change of heart.</br></br>Personally, I have come to realize how important Steve Jobs has been for the history of computers, and I thought the movie was excellent. It really brings out both the good and the bad sides of both Steve Jobs and us humans in general."}, {"title": "Board games?? and communication", "author": "Thomas, September 13th", "content": "We played some board games in class to experience some more interactive ways of learning about communication. We first tried a game called \"Aye, Dark Overlord\", but it was way - and I mean way - too complicated to even work out how to play it. We ended up just throwing the cards on the table trying to make a funny story without actually playing the game before giving up and finding another game to play. </br></br>We ended up actually playing Heads Up! instead (not really a board game but I don't care). In case you're living under a rock, Heads Up! is a game where you take turns holding the phone up to your forehead and it will show some random word that the others have to explain to you so you can guess it. This is what makes the game relevant in terms of communication. In order to be able to guess what word you have, you have to rely on that your friends can explain the term properly. </br></br>I'm pretty sure this will translate pretty realistically into the work life. As tech support, you will at some point have to deal with customers that know little to nothing about PCs and tech. In those moments, it's important that you are able to explain things clearly and make it simple enough that even the most technologically impaired people are able to get at least a sense of how their problems can be fixed.</br></br>Heads Up! doesn't really have any strategies for winning per se, since everyone is more or less on the same team, but regardless, it can provide som much needed exercise in communication and how to relay information directly, precisely and in relatively short time. The game itself is, of course, on a time limit of one minute, and preferably you want to get more than one or two words in that time."}, {"title": "All That For a Pack of Cookies", "author": "Thomas, September 20th 2019", "content": "You are playing video games when you suddenly start to become hungry. You want cookies, but not just any cookies. They have to be the best cookies from Rema 420. So you pause your online game (don't ask how) and head outside towards the store.</br></br>You're walking across the parking lot, when suddenly a strange portal opens in front of you. You were lost in thought, listening to a podcast or something, and as stupid as you are, you walk straight into that portal. You quickly realize your stupid mistake. You have been transported into a strange, new dimension and you have no idea where you are. You read about a place like this once, on a totally trustworthy wiki-page, but you thought it was only a myth.</br></br>The entire area seems to be filled with cookies, but upon further inspection, they appear to be mechanical cookies, which are not edible. You take some time to walk around and see if you can find civilization, and eventually you find a town. The town does not have a Rema 420, so you decide that you have no choice but to get back home if you want your cookies.</br></br>Asking around in the village, it appears there exists a magician known as the \"Magical Wizard of Technologicality\", but the townspeople will not tell you of his whereabouts until you help them with their needs. (This begins a somewhat lengthy part of the game where you have to do several sidequests to gain the trust of the villagers.)</br></br>When the villagers are satisfied with your efforts, they reveal the location of the Wizard's lair to you. Turns out it was just over the hill behind the village, and they really just wanted someone to do their job for them. You make your way to the Wizard's abode, and as you enter, he reveals that he has been watching you ever since you arrived, and your valiant efforts in doing other people's work has proven to him that you are worthy of returning to your own world. He casts his powerful spell, known as the \"Big Teleport\"</br></br>Suddenly, you find yourself back in the parking lot in front of Rema 420. You breathe a sigh of relief, finally being able to get that pack of cookies. You head into the store, get those damn cookies, and finally make your way back home. You open the pack, and you instantly feel the amazing smell of chocolate chip cookies. You go back to your room and unpause your online game, because you can. About 30 minutes go by, before you realize that you have eaten up ALL your cookies. You still want more cookies, so you have no choice but to go back to the store</br></br>Let's just hope there are no portals this time."}, {"title": "Working at Kantega", "author": "Thomas, November 5th 2019", "content": "The first company I'm working at is Kantega. They are an IT-company focused on maintaining and improving IT solutions for the people, be it operating existing software and/or hardware, making new services or doing customer support. They are also offering counseling for other companies who want to do big investments in IT, and and security services.</br></br>I have been placed in the section that operates the services and makes sure they're working as they should. There isn't that much I can do to help because of this, since it requires them to know all the software they are working in and how to solve problems more efficiently. I have gotten my own tasks that I work on at my own pace, and I'm free to ask for help if I need to.</br></br>One thing I'm noticing while working here is that the environment is very relaxed. It's very easy to get along with the other employees here, and i don't feel uncomfortable sitting here with a bunch of people who know way more than me. There are also activities to do outside of the actual work. There's a small area outside of the office where you can play pool and table soccer, they have a dedicated massage room, and every once in a while there are held 10 minute presentations in the cantine about whatever the presenter for the day feels like talking about. I find it really fascinating how everyone is able to maintain a standard of professionalism while also having such an easy work environment.</br></br>I've really enjoyed working here so far and I have high hopes for the rest of the week."}, {"title": "What I've been doing at Kantega", "author": "Thomas, November 8th 2019", "content": "While working at Kantega, I was given a set of tasks that I would work on at my own pace, and really only ask for help if I needed it. IT is a field that requires proper knowledge and understanding to be able to work on actual projects, so there really wasn't anything I could help out with there.</br></br>The tasks I got are all related to Linux. I told them beforehand that I would be interested in learning more about Linux and programming, so they set up a sort of lab project around that. Linux is an operating system that functions very differently from Windows and OSX, and is much more oriented towards developers. Working in Linux is file based, but files don't work the same as in the other operating systems either, so I had to start from the very beginning to understand the concept of how it works. You can't just make a new file, give it a .txt file ending and expect it to be a text file in Linux.</br></br>The first few tasks I got was mostly getting to know the OS and making myself familiar with the terminal and its commands. Then I got the \"big\" task, which I spent the majority of the week on. It's called Capture the Flag, and it's a sort of game where you have to use the functions and commands in the Linux terminal to solve puzzles and get passwords to move through the various levels. It really puts your brain to the test.</br></br>The last tasks I got had to do with setting up web servers. They made an empty subdomain for me, and my job was to remote connect to their servers and make the page say \"Hello world.\" I did it in an easy way (editing the HTML file) and a harder way (setting up a flask app in python that returns \"Hello world\" when the app is launched).</br></br></br>Those were the main tasks I got, but there was still plenty of time left in the week, so I got another task as well, to set up my own personal web page, to use as for example a blog or something similar. I haven't gotten too far on it yet, but by the end of the week, I had gotten my own domain, and got the web server up and running. "}, {"title": "Kantega: A summary", "author": "Thomas, November 8th 2019", "content": "Over the past week, I have learned a lot. And I truly mean a lot. To be fair, most of it is related to Linux, but Linux is such an important thing to understand in this field, and I really believe I'll get use for it. Everything from knowing how to manage and navigate the terminal and file system, to setting up web pages using Python Flask and nginx.</br></br>I'm really motivated to learn more about Linux and keep working on my own projects. During the end of the week, I was setting up my own web page that I can manage on my own, and I intent to keep working on it even when this work period is over."}, {"title": "Norsk Helsenett", "author": "Thomas, Novermber 17th 2019", "content": "Norsk Helsenett is an IT firm and a vital part of the Norwegian health network. It maintains and develops new and existing solutions for the security and integrity of health data, which is critical to be able to perform proper medical procedures on patients. Data like this can very easily be used by people with wrong intent, and so Norsk Helsenett works around the clock to make sure everything is working as it should.</br></br>In addition to maintaining the health network, it also supplies IT equipment to several of the health sections in Norway, such as doctor's offices, physio therapy clinics, chiropractors, etc. The only exception is that they don't supply hospitals directly.</br></br>I was placed in Norsk Helsenett's internal IT team. The firm has several sections within itself which performs various functions in the bigger picture, but whenever the employees in Norsk Helsenett itself needs IT-related help, the internal IT team is who they contact. This means everything from problems with their PC or other equipment, wanting to order new equipment, requesting permissions, etc.</br></br>Norsk Helsenett is a really high standing and prestigious firm, so I'm happy i got the chance to work there."}, {"title": "Practical work at Norsk Helsenett", "author": "Thomas, November 17th 2019", "content": "One of the practical jobs I was given while working at Norsk Helsenett was preparing a few computers. For security reasons, they have to heavily restrict what employees can do with their work PCs, and when preparing new ones, they \"tank\" them, and this is what I did. It runs a script that installs the OS the user in question wants, and prepares neccessary software and permissions. It's a mostly automatic process, but there are a bunch of prompts you have to click through, and generally, someone has to be present to make sure everything goes the way it should.</br></br>I wasn't given too many practical things to do during the week, so this was the most notable one. Other than that, I helped the internal IT team with stuff like unboxing new deliveries, carrying new equipment to employees who requested it, etc."}, {"title": "How it's been at NHN", "author": "Thomas, November 17th 2019", "content": "While staying at Norsk Helsenett, I've been doing a lot, and not just in the internal IT section. I visited the operations center and the various teams that operate the network. There were several meetings or presentations in which people talked about the various things people do in Norsk Helsenett, everything from who they are and what they do, to the use of Windows and Linux servers and the development of new tech.</br></br>I've been thinking a bunch about what direction I want to take, and I have decided that I probably wouldn't enjoy working in support for very long. I think working in operations or pursuing further education in development might be a better bet."}]